import './ProductDescription.css'
import { useLocation } from 'react-router-dom';

export default function ProductDescription()
{
    const productDescription = [
        {
            title: "Листівка", 
            firstParagraph: "Основна функція листівки – швидке донесення інформації до цільової аудиторії. Вона може містити рекламні пропозиції, анонси заходів, спеціальні знижки, контактні дані або іншу корисну інформацію. Часто використовується для масового розповсюдження в громадських місцях, поштових розсилках або під час промоакцій.",
            secondParagraph: "Це один із найпопулярніших видів друкованої продукції, що використовується для передачі коротких, але змістовних повідомлень. Вона може мати різні розміри, форми та види друку, залежно від її призначення. Зазвичай листівки друкують на щільному папері з одностороннім або двостороннім оформленням.",
            thirdParagraph: "Листівки ідеально підходять для бізнесу, маркетингових кампаній, соціальної реклами або навіть персональних повідомлень. Вони можуть бути як простими та лаконічними, так і креативними – з унікальним дизайном, що привертає увагу та запам’ятовується.",
        },
        {
            title: "Буклет",
            firstParagraph: "Буклет – багатосторінковий друкований виріб, що містить детальнішу інформацію про компанію, продукт або послугу. Він зазвичай складається з одного великого аркуша, складеного у кілька згинів (бігів), що створює кілька сторінок.",
            secondParagraph: "Основне призначення буклета – донести до клієнта розширену інформацію у зручному форматі. Його часто використовують для рекламних кампаній, виставок, презентацій, каталогів послуг, туристичних путівників або інструкцій. Буклети можуть бути різних розмірів та форм, а також містити яскравий дизайн, фото, ілюстрації та текст.",
            thirdParagraph: "Головна перевага буклетів – зручність у зберіганні та розповсюдженні. Їх легко брати з собою, читати у транспорті або переглядати на дозвіллі.", 
        },
        {
            title: "Блокнот",
            firstParagraph: "Блокнот – це практичний та універсальний друкований виріб для записів, який може використовуватися як у повсякденному житті, так і в корпоративному середовищі. Блокноти можуть бути різних форматів (A4, A5, A6), з лінійкою, клітинкою або чистими аркушами.",
            secondParagraph: "Основне призначення блокнота – ведення записів, планування справ, складання списків або заміток. Він може бути персоналізованим – із логотипом компанії, фірмовими кольорами або навіть мотиваційними цитатами.",
            thirdParagraph: "Блокноти часто використовуються як рекламні сувеніри, корпоративні подарунки або частина брендованої канцелярії для співробітників та партнерів.", 
        },
        {
            title: "Візитка", 
            firstParagraph: "Візитка – це компактний носій контактної інформації, який використовується для представлення особи або компанії. Стандартний розмір візитки – 90×50 мм або 85×55 мм, але можливі й нестандартні варіанти.",
            secondParagraph: "Візитки містять ім’я, посаду, контактні дані, логотип та інші важливі елементи. Вони можуть бути одно- або двосторонніми, з матовим чи глянцевим покриттям, тисненням або вибірковим лакуванням.",
            thirdParagraph: "Основна мета візитки – створити перше враження про компанію або людину та полегшити встановлення контактів у бізнес-середовищі. Вони широко використовуються на ділових зустрічах, конференціях, виставках і просто в повсякденному спілкуванні.",
        },
        {
            title: "Постер", 
            firstParagraph: "Постер – великий друкований аркуш із зображенням, рекламним або інформаційним текстом, який призначений для розміщення на стінах або спеціальних поверхнях. Його основна функція – привернення уваги завдяки яскравому дизайну та лаконічному змісту.",
            secondParagraph: "Постери використовуються у рекламних кампаніях, на культурних заходах, в інтер’єрах кафе, магазинів та офісів. Вони можуть містити афіші концертів, кіноанонси, мотиваційні цитати або графічний дизайн для декору приміщень.",
            thirdParagraph: "Завдяки великому розміру та привабливому оформленню постери ефективно працюють у місцях з великим потоком людей.",
        },
        {
            title: "Бірка", 
            firstParagraph: "Бірка – невеликий друкований елемент, який використовується для маркування товарів, одягу або сувенірної продукції. Вона може містити логотип компанії, назву бренду, характеристики товару, ціну або QR-код.",
            secondParagraph: "Бірки можуть бути паперовими, картонними, пластиковими або текстильними. Вони додають товару індивідуальності та підкреслюють його фірмовий стиль.",
            thirdParagraph: "Часто бірки використовуються у fashion-індустрії, hand-made продукції або для преміального пакування.",
        },
        {
            title: "Конверт", 
            firstParagraph: "Конверт – друкований виріб, призначений для пересилання листів, документів або рекламних матеріалів. Він може бути стандартного розміру (C4, C5, DL) або нестандартної форми під індивідуальні потреби.",
            secondParagraph: "Конверти можуть мати віконце, липкий клапан, захисне покриття або брендування. Вони використовуються як у діловій кореспонденції, так і в маркетингових розсилках, забезпечуючи презентабельний вигляд листування.",
            thirdParagraph: "Брендовані конверти допомагають підтримувати корпоративний стиль та підвищувати впізнаваність компанії.",
        },
        {
            title: "Флаєр", 
            firstParagraph: "Флаєр – невеликий рекламний аркуш, що використовується для швидкого розповсюдження інформації. Він зазвичай має яскравий дизайн, короткий текст та заклик до дії.",
            secondParagraph: "Флаєри роздають на заходах, у торгових центрах, вкладають у пакування товарів або використовують у вуличних промоакціях.",
            thirdParagraph: "На відміну від листівки, флаєр зазвичай має більш акційний характер, наприклад, пропозицію знижки, запрошення на відкриття магазину чи презентацію нового продукту.",
        }
    ]

    const location = useLocation();

    const selectedTitle  = location.state;

    const selectedProduct = productDescription.find(item => item.title === selectedTitle);

    if (!selectedProduct) {
        return <p>Товар не вибрано</p>;
    }

    return (
    <div className="product-description-container">
        <div className='product-description-title-box'>
            <p className="product-description-title">Опис</p>
        </div>
        <div className='product-description-paragraph-box'>
            <p className="product-description-paragraph">{selectedProduct.firstParagraph}</p>
            <p className="product-description-paragraph">{selectedProduct.secondParagraph}</p>
            <p className="product-description-paragraph">{selectedProduct.thirdParagraph}</p>
        </div>
        
    </div>
);

} 